Revit 2026 API

# MEPCalculationServerInfo(MEPCalculationServerInfo) Constructor

---

Constructs a new copy of the input MEPCalculationServerInfo object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPCalculationServerInfo(
	MEPCalculationServerInfo other
)
```
```vb
Public Sub New (
	other As MEPCalculationServerInfo
)
```
```cpp
public:
MEPCalculationServerInfo(
	MEPCalculationServerInfo^ other
)
```
```fsharp
new :
        other : MEPCalculationServerInfo -> MEPCalculationServerInfo
```

#### Parameters

other MEPCalculationServerInfo

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

MEPCalculationServerInfo Class

MEPCalculationServerInfo Overload

Autodesk.Revit.DB Namespace